[
  {
    "id": 1,
    "bookId": "B001",
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co/bNND8fB/download-1-removebg-preview.png",
    "review": "The Silent Patient by Alex Michaelides is a gripping psychological thriller that delves deep into the human psyche. The story revolves around Alicia Berenson, a famous painter who is accused of murdering her husband and then goes silent, never speaking another word. Theo Faber, a forensic psychologist, becomes obsessed with uncovering the truth behind Alicia's silence. As Theo delves into Alicia's past and present, the story takes unexpected twists and turns, revealing dark secrets and psychological complexities. Michaelides' writing is sharp and suspenseful, keeping readers on the edge of their seats until the shocking conclusion. The Silent Patient explores themes of guilt, obsession, and the complexity of the human mind, making it a compelling read for fans of psychological thrillers.",
    "totalPages": 336,
    "rating": 4.3,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "id": 2,
    "bookId": "B002",
    "bookName": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://i.ibb.co/0DVZF6p/download-2-removebg-preview.png",
    "review": "Where the Crawdads Sing by Delia Owens is a beautifully written and atmospheric novel set in the marshlands of North Carolina. The story follows Kya Clark, known as the \"Marsh Girl,\" who grows up isolated in the wild after being abandoned by her family. As Kya matures, she becomes a respected naturalist and is drawn into a murder investigation that threatens to unravel the quiet life she has built. Owens' prose is lyrical and evocative, vividly capturing the beauty of the marshlands and the resilience of the human spirit. Where the Crawdads Sing is not just a mystery but also a poignant exploration of loneliness, love, and the bonds that connect us to nature and each other.",
    "totalPages": 384,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Nature", "Coming of Age"],
    "publisher": "G.P. Putnam's Sons",
    "yearOfPublishing": 2018
  },
  {
    "id": 3,
    "bookId": "B003",
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://i.ibb.co/7bm0vyZ/download-removebg-preview.png",
    "review": "Educated by Tara Westover is a powerful memoir that chronicles her journey from growing up in a strict survivalist family in rural Idaho to ultimately earning a PhD from Cambridge University. Westover's upbringing is marked by extreme isolation, limited education, and familial control. As she seeks knowledge and independence, she grapples with the conflicting loyalties between her family and her desire for self-discovery. The memoir is a testament to the transformative power of education and the resilience of the human spirit. Westover's prose is raw and introspective, capturing the emotional turmoil and triumph of her personal odyssey.",
    "totalPages": 352,
    "rating": 4.1,
    "category": "Memoir",
    "tags": ["Education", "Family"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "id": 4,
    "bookId": "B004",
    "bookName": "The Night Circus",
    "author": "Erin Morgenstern",
    "image": "https://i.ibb.co/72HvTBd/Hard-Cover-1-1-removebg-preview.png",
    "review": "The Night Circus by Erin Morgenstern is a magical and enchanting novel that transports readers to a mysterious circus that arrives without warning and disappears just as mysteriously. The circus, Le Cirque des Rêves, is a playground for the imagination, filled with wonders and illusions that captivate both its visitors and its performers. Morgenstern's writing is lyrical and atmospheric, creating a world where reality and fantasy blend seamlessly. The novel weaves together multiple storylines, including a magical competition between two young illusionists, Celia and Marco, who are bound by destiny and love. The Night Circus is a mesmerizing and immersive read that will enchant readers with its spellbinding tale of love, magic, and destiny.",
    "totalPages": 387,
    "rating": 4.5,
    "category": "Fantasy",
    "tags": ["Magic", "Romance"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2011
  },
  {
    "id": 5,
    "bookId": "B005",
    "bookName": "The Goldfinch",
    "author": "Donna Tartt",
    "image": "https://i.ibb.co/7QRBBMT/Hard-Cover-1-2-removebg-preview.png",
    "review": "The Goldfinch by Donna Tartt is a sweeping and immersive novel that follows the life of Theo Decker, a young boy who survives a terrorist attack at the Metropolitan Museum of Art in New York City. In the aftermath of the tragedy, Theo steals a priceless painting, The Goldfinch, setting off a chain of events that shape his life. Tartt's writing is richly detailed and emotionally resonant, capturing the complexities of Theo's journey from grief-stricken orphan to troubled young man. The novel explores themes of art, loss, and the search for identity with a gripping narrative and vividly drawn characters. The Goldfinch is a masterpiece of storytelling that offers readers an unforgettable literary experience.",
    "totalPages": 784,
    "rating": 4.4,
    "category": "Literary Fiction",
    "tags": ["Art", "Redemption"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 2013
  },
  {
    "id": 6,
    "bookId": "B006",
    "bookName": "The Martian",
    "author": "Andy Weir",
    "image": "https://i.ibb.co/k3kdWf4/Hard-Cover-2-2-removebg-preview.png",
    "review": "The Martian by Andy Weir is a thrilling and scientifically accurate novel that follows astronaut Mark Watney's struggle for survival on Mars after being stranded by his crew. Watney must rely on his ingenuity and resourcefulness to overcome numerous challenges and find a way to communicate with NASA for a rescue mission. Weir's writing is witty and suspenseful, blending humor with technical detail to create a compelling narrative. The novel is a celebration of human resilience and the spirit of exploration, offering a realistic portrayal of space travel and scientific problem-solving. The Martian is an exhilarating read that will appeal to both science fiction enthusiasts and general readers alike.",
    "totalPages": 369,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Survival", "Space Exploration"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2011
  },
  {
    "id": 7,
    "bookId": "B007",
    "bookName": "Little Fires Everywhere",
    "author": "Celeste Ng",
    "image": "https://i.ibb.co/FwS9kZZ/Hard-Cover-4-1-removebg-preview.png",
    "review": "Little Fires Everywhere by Celeste Ng is a captivating novel that explores the weight of secrets, the nature of art and identity, and the ferocious pull of motherhood. The story unfolds in the planned community of Shaker Heights, Ohio, where the arrival of Mia Warren and her daughter upends the lives of the affluent Richardson family. As the characters' lives intertwine and tensions rise, Ng examines issues of privilege, race, and belonging with nuance and empathy. Her prose is insightful and evocative, capturing the complexities of familial and societal expectations. Little Fires Everywhere is a thought-provoking and emotionally resonant read that leaves a lasting impact.",
    "totalPages": 352,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Family Drama", "Identity"],
    "publisher": "Penguin Press",
    "yearOfPublishing": 2017
  },
  {
    "id": 8,
    "bookId": "B008",
    "bookName": "Circe",
    "author": "Madeline Miller",
    "image": "https://i.ibb.co/yy80wY6/Hard-Cover-5-1-V2-removebg-preview.png",
    "review": "Circe by Madeline Miller is a mesmerizing retelling of the myth of Circe, the powerful witch from Homer's Odyssey. Miller brings Circe to life, crafting a narrative that explores her journey from a misunderstood daughter of the sun god Helios to a formidable witch in her own right. The novel is rich with mythology and magic, offering readers a fresh perspective on familiar Greek myths. Miller's prose is lyrical and immersive, drawing readers into Circe's world of gods, monsters, and mortals. Circe is a celebration of female strength and resilience, blending timeless themes of love, betrayal, and self-discovery into a spellbinding tale.",
    "totalPages": 400,
    "rating": 4.6,
    "category": "Mythology",
    "tags": ["Greek Mythology", "Witchcraft"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 2018
  },
  {
    "id": 9,
    "bookId": "B009",
    "bookName": "The Seven Husbands of Evelyn Hugo",
    "author": "Taylor Jenkins Reid",
    "image": "https://i.ibb.co/VQBVYqZ/Hardcover-Transparent-removebg-preview.png",
    "review": "The Seven Husbands of Evelyn Hugo by Taylor Jenkins Reid is a captivating and brilliantly written novel that delves into the glamorous and tumultuous life of Evelyn Hugo, a Hollywood icon. The novel is structured as a series of interviews between Evelyn and an unknown journalist, revealing the secrets and scandals of her seven marriages. Reid's writing is evocative and emotionally resonant, capturing the complexities of love, ambition, and identity in Hollywood's golden age. The novel explores themes of fame, sexuality, and the price of success with depth and sensitivity. The Seven Husbands of Evelyn Hugo is a must-read for fans of historical fiction and compelling character-driven narratives.",
    "totalPages": 400,
    "rating": 4.7,
    "category": "Historical Fiction",
    "tags": ["Hollywood", "Identity"],
    "publisher": "Atria Books",
    "yearOfPublishing": 2017
  },
  {
    "id": 10,
    "bookId": "B010",
    "bookName": "Pachinko",
    "author": "Min Jin Lee",
    "image": "https://i.ibb.co/Qnj5D7x/images-1-removebg-preview.png",
    "review": "Pachinko by Min Jin Lee is a sweeping epic that spans generations and continents, tracing the lives of a Korean family in Japan from the early 20th century to the 1980s. The novel begins with Sunja, a young woman who falls pregnant out of wedlock and finds herself married to a minister who offers her a chance at a new life in Japan. As the family navigates the challenges of discrimination, war, and cultural identity, Lee explores themes of resilience, sacrifice, and the pursuit of belonging. Her prose is poignant and immersive, capturing the personal and historical struggles of her characters with empathy and depth. Pachinko is a profound and unforgettable tale of family, identity, and the enduring human spirit.",
    "totalPages": 496,
    "rating": 4.5,
    "category": "Historical Fiction",
    "tags": ["Family Saga", "Korean Diaspora"],
    "publisher": "Grand Central Publishing",
    "yearOfPublishing": 2017
  },
  {
    "id": 11,
    "bookId": "B011",
    "bookName": "A Man Called Ove",
    "author": "Fredrik Backman",
    "image": "https://i.ibb.co/C2qLR8f/images-2-removebg-preview.png",
    "review": "A Man Called Ove by Fredrik Backman is a heartwarming and humorous novel that introduces readers to Ove, a curmudgeonly old man who finds his solitary world turned upside down by new neighbors and unexpected friendships. As Ove reluctantly gets involved in the lives of those around him, his grumpy exterior begins to soften, revealing a complex and compassionate man beneath. Backman's writing is poignant and insightful, blending moments of laughter with deep emotional resonance. The novel explores themes of love, loss, and the power of human connection, offering a touching portrayal of the universal need for belonging and understanding.",
    "totalPages": 337,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Humor", "Friendship"],
    "publisher": "Atria Books",
    "yearOfPublishing": 2012
  },
  {
    "id": 12,
    "bookId": "B012",
    "bookName": "The Great Alone",
    "author": "Kristin Hannah",
    "image": "https://i.ibb.co/41HVsbr/images-4-removebg-preview.png",
    "review": "The Great Alone by Kristin Hannah is a gripping and emotionally charged novel set in the wilderness of Alaska in the 1970s. The story follows the Allbright family as they move to the rugged and remote landscape to start anew. As winter approaches and darkness descends, the family must confront their inner demons and the harsh realities of survival in the wilderness. Hannah's prose is vivid and atmospheric, capturing the beauty and brutality of Alaska's landscape. The novel explores themes of resilience, trauma, and the bonds of family with raw honesty and compassion. The Great Alone is a compelling and unforgettable story of love, loss, and the power of the human spirit.",
    "totalPages": 440,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Alaska", "Family Dynamics"],
    "publisher": "St. Martin's Press",
    "yearOfPublishing": 2018
  },
  {
    "id": 13,
    "bookId": "B013",
    "bookName": "The Underground Railroad",
    "author": "Colson Whitehead",
    "image": "https://i.ibb.co/PYfk4xK/images-6-removebg-preview.png",
    "review": "The Underground Railroad by Colson Whitehead is a powerful and haunting novel that reimagines the historical Underground Railroad as an actual railroad system beneath the antebellum South. The story follows Cora, a young slave on a Georgia plantation, as she embarks on a perilous journey to freedom. As Cora travels through the underground network, each stop exposes her to different horrors and hopes, confronting the brutal realities of slavery and the resilience of the human spirit. Whitehead's prose is lyrical and evocative, weaving together history and fiction to create a narrative that is both gripping and thought-provoking. The Underground Railroad is a testament to the enduring legacy of slavery and the pursuit of liberty, resonating with relevance in today's world.",
    "totalPages": 320,
    "rating": 4.5,
    "category": "Historical Fiction",
    "tags": ["Slavery", "Freedom"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2016
  },
  {
    "id": 14,
    "bookId": "B014",
    "bookName": "The Book Thief",
    "author": "Markus Zusak",
    "image": "https://i.ibb.co/7bm0vyZ/download-removebg-preview.png",
    "review": "The Book Thief by Markus Zusak is a poignant and unforgettable story set in Nazi Germany, narrated by Death himself. The novel follows Liesel Meminger, a young girl who steals books to escape the harsh realities of war and loss. Through her eyes, readers witness the power of words to both destroy and redeem, as Liesel discovers the transformative impact of storytelling in dark times. Zusak's writing is lyrical and haunting, painting a vivid portrait of humanity's capacity for both cruelty and compassion. The Book Thief is a testament to the resilience of the human spirit and the enduring power of literature to illuminate even the darkest moments of history.",
    "totalPages": 552,
    "rating": 4.4,
    "category": "Historical Fiction",
    "tags": ["World War II", "Literature"],
    "publisher": "Knopf Books for Young Readers",
    "yearOfPublishing": 2005
  },
  {
    "id": 15,
    "bookId": "B015",
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/FwS9kZZ/Hard-Cover-4-1-removebg-preview.png",
    "review": "The Alchemist by Paulo Coelho is a timeless and inspiring tale of Santiago, a shepherd boy who embarks on a journey to find a treasure in the Egyptian pyramids. Along the way, he encounters a series of characters who impart wisdom and guidance, leading him to discover the true meaning of his own destiny. Coelho's writing is simple yet profound, weaving together themes of fate, dreams, and the importance of listening to one's heart. The Alchemist is more than just a novel; it is a philosophical meditation on life's journey and the pursuit of one's dreams. With its universal themes and lyrical prose, The Alchemist continues to resonate with readers around the world.",
    "totalPages": 208,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Adventure", "Philosophy"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988
  },
  {
    "id": 16,
    "bookId": "B016",
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/yy80wY6/Hard-Cover-5-1-V2-removebg-preview.png",
    "review": "To Kill a Mockingbird by Harper Lee is a classic novel that explores themes of racial injustice, moral growth, and the loss of innocence in the American South during the 1930s. The story is told through the eyes of Scout Finch, a young girl who observes her father, Atticus Finch, defend a black man accused of raping a white woman. As the trial unfolds, Scout confronts the harsh realities of prejudice and learns valuable lessons about empathy and courage. Lee's writing is compassionate and evocative, capturing the complexities of small-town life and the enduring power of compassion in the face of injustice. To Kill a Mockingbird remains a poignant and essential work of literature that continues to resonate with readers of all ages.",
    "totalPages": 281,
    "rating": 4.6,
    "category": "Classic Literature",
    "tags": ["Race Relations", "Coming of Age"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "id": 17,
    "bookId": "B017",
    "bookName": "The Kite Runner",
    "author": "Khaled Hosseini",
    "image": "https://i.ibb.co/VQBVYqZ/Hardcover-Transparent-removebg-preview.png",
    "review": "The Kite Runner by Khaled Hosseini is a powerful and heartbreaking novel that explores friendship, betrayal, and redemption against the backdrop of Afghanistan's turbulent history. The story is narrated by Amir, a privileged Pashtun boy, who forms a deep bond with his servant's son, Hassan. However, Amir's betrayal of Hassan haunts him into adulthood, driving him to seek redemption years later in war-torn Kabul. Hosseini's writing is lyrical and evocative, capturing the beauty of Afghanistan's landscapes and the devastation wrought by decades of conflict. The Kite Runner is a deeply moving story that examines the consequences of our choices and the possibility of forgiveness.",
    "totalPages": 371,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Friendship", "Redemption"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2003
  },
  {
    "id": 18,
    "bookId": "B018",
    "bookName": "The Testaments",
    "author": "Margaret Atwood",
    "image": "https://i.ibb.co/C2qLR8f/images-2-removebg-preview.png",
    "review": "The Testaments by Margaret Atwood is a compelling sequel to her dystopian masterpiece, The Handmaid's Tale. Set 15 years after the events of the first novel, The Testaments offers a riveting glimpse into the lives of three women in the oppressive regime of Gilead. Atwood weaves together the narratives of Aunt Lydia, a key figure in Gilead's hierarchy; Agnes, a young girl raised within the regime; and Daisy, a teenager living in Canada who discovers her connection to Gilead. As their stories converge, The Testaments explores themes of power, resistance, and the enduring fight for justice and freedom. Atwood's prose is sharp and incisive, delivering a timely and thought-provoking narrative that resonates with contemporary issues.",
    "totalPages": 432,
    "rating": 4.4,
    "category": "Dystopian Fiction",
    "tags": ["Feminism", "Totalitarianism"],
    "publisher": "Nan A. Talese",
    "yearOfPublishing": 2019
  },
  {
    "id": 19,
    "bookId": "B019",
    "bookName": "Normal People",
    "author": "Sally Rooney",
    "image": "https://i.ibb.co/41HVsbr/images-4-removebg-preview.png",
    "review": "Normal People by Sally Rooney is a tender and intimate exploration of love, friendship, and the complexities of modern relationships. The novel follows the on-again, off-again relationship between Connell and Marianne, two young people from a small town in Ireland who navigate the challenges of university life and adulthood. Rooney's writing is spare yet powerful, capturing the nuances of human emotions and interpersonal dynamics with honesty and empathy. Through Connell and Marianne's evolving connection, Normal People examines themes of identity, class, and the impact of social expectations on personal happiness. The novel is a poignant portrayal of young love and the search for belonging in a rapidly changing world.",
    "totalPages": 273,
    "rating": 4.2,
    "category": "Literary Fiction",
    "tags": ["Relationships", "Identity"],
    "publisher": "Hogarth Press",
    "yearOfPublishing": 2018
  },
  {
    "id": 20,
    "bookId": "B020",
    "bookName": "The Girl on the Train",
    "author": "Paula Hawkins",
    "image": "https://i.ibb.co/PYfk4xK/images-6-removebg-preview.png",
    "review": "The Girl on the Train by Paula Hawkins is a gripping psychological thriller that keeps readers on the edge of their seats from start to finish. The story unfolds through the perspectives of three women—Rachel, Anna, and Megan—whose lives become intertwined in unexpected and dangerous ways. Rachel, an alcoholic struggling with depression, becomes fixated on a couple she observes from the train, only to be drawn into a web of deceit and betrayal. Hawkins' writing is tense and atmospheric, creating a sense of unease that builds with each twist and turn. The Girl on the Train is a masterfully plotted thriller that explores themes of memory, obsession, and the dark truths that lie beneath seemingly ordinary lives.",
    "totalPages": 336,
    "rating": 4.1,
    "category": "Thriller",
    "tags": ["Mystery", "Suspense"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2015
  },
  {
    "id": 21,
    "bookId": "B021",
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/bNND8fB/download-1-removebg-preview.png",
    "review": "1984 by George Orwell is a dystopian novel that explores the dangers of totalitarianism and the erosion of individual freedom. Set in a future society dominated by a repressive regime led by Big Brother, the novel follows Winston Smith, a disillusioned Party member who dares to question the authority and control imposed upon the population. Orwell's depiction of surveillance, propaganda, and thought control remains eerily relevant in today's world, serving as a chilling warning against the dangers of authoritarianism and the manipulation of truth.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Dystopian Fiction",
    "tags": ["Totalitarianism", "Surveillance"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "id": 22,
    "bookId": "B022",
    "bookName": "The Night Circus",
    "author": "Erin Morgenstern",
    "image": "https://i.ibb.co/0DVZF6p/download-2-removebg-preview.png",
    "review": "The Night Circus by Erin Morgenstern is a mesmerizing and enchanting novel that transports readers to a magical world of a mysterious circus that arrives without warning and opens only at night. The story follows Celia Bowen and Marco Alisdair, two young illusionists bound in a magical competition orchestrated by their mentors. As their rivalry intensifies, their creations enchant and captivate the circus's visitors, blurring the line between reality and illusion. Morgenstern's prose is lyrical and immersive, weaving together themes of love, destiny, and the transformative power of art. The Night Circus is a spellbinding tale that sparks the imagination and leaves a lasting impression.",
    "totalPages": 387,
    "rating": 4.5,
    "category": "Fantasy",
    "tags": ["Magic", "Competition"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2011
  },
  {
    "id": 23,
    "bookId": "B023",
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://i.ibb.co/7bm0vyZ/download-removebg-preview.png",
    "review": "Educated by Tara Westover is a powerful memoir that chronicles her journey from a childhood in a strict and isolated Idaho survivalist family to earning a PhD from Cambridge University. Westover recounts her struggle for education against the backdrop of familial loyalty and the challenges of self-discovery. Her narrative is both harrowing and inspiring, highlighting the transformative impact of learning and the pursuit of knowledge. Educated explores themes of resilience, identity, and the complexities of family ties with raw honesty and introspection. Westover's memoir is a testament to the power of education to break barriers and shape one's destiny.",
    "totalPages": 352,
    "rating": 4.6,
    "category": "Memoir",
    "tags": ["Education", "Family Dynamics"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "id": 24,
    "bookId": "B024",
    "bookName": "The Goldfinch",
    "author": "Donna Tartt",
    "image": "https://i.ibb.co/72HvTBd/Hard-Cover-1-1-removebg-preview.png",
    "review": "The Goldfinch by Donna Tartt is a sweeping novel of art, loss, and redemption that follows the life of Theo Decker, who survives a terrorist bombing at a museum that kills his mother. In the chaos, Theo steals a famous painting, The Goldfinch, which becomes a symbol of his grief and guilt as he navigates the complexities of his life. Tartt's prose is richly detailed and immersive, capturing the intricacies of Theo's coming-of-age journey from New York to Las Vegas and beyond. The Goldfinch is a compelling exploration of the power of art to transcend tragedy and illuminate the human experience.",
    "totalPages": 771,
    "rating": 4.3,
    "category": "Literary Fiction",
    "tags": ["Art", "Loss"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 2013
  },
  {
    "id": 25,
    "bookId": "B025",
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co/7QRBBMT/Hard-Cover-1-2-removebg-preview.png",
    "review": "Sapiens: A Brief History of Humankind by Yuval Noah Harari is a thought-provoking exploration of the history of our species, from the emergence of Homo sapiens in East Africa to the present day. Harari examines key revolutions that have shaped human societies, from the Cognitive Revolution that enabled the development of language and culture to the Agricultural and Scientific Revolutions that transformed civilizations. His narrative challenges conventional wisdom and offers new perspectives on the forces that have shaped our collective destiny. Sapiens is a compelling and accessible journey through the arc of human history, inviting readers to reconsider their place in the world.",
    "totalPages": 443,
    "rating": 4.8,
    "category": "Nonfiction",
    "tags": ["History", "Anthropology"],
    "publisher": "Harper",
    "yearOfPublishing": 2014
  },
  {
    "id": 26,
    "bookId": "B026",
    "bookName": "Crazy Rich Asians",
    "author": "Kevin Kwan",
    "image": "https://i.ibb.co/k3kdWf4/Hard-Cover-2-2-removebg-preview.png",
    "review": "Crazy Rich Asians by Kevin Kwan is a hilarious and satirical novel that offers a peek into the extravagant lives of Asia's ultra-rich elite. The story follows Rachel Chu, an American-born Chinese professor, who accompanies her boyfriend Nick Young to Singapore for his best friend's wedding. There, she discovers Nick's insanely wealthy and snobbish family, navigating the complexities of social status, family expectations, and old-money traditions. Kwan's writing is witty and entertaining, blending opulent descriptions with sharp social commentary. Crazy Rich Asians is a delightful romp through the world of privilege and excess, offering a humorous yet insightful look at love, identity, and the clash of cultures.",
    "totalPages": 527,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Satire", "Asian Culture"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2013
  },
  {
    "id": 27,
    "bookId": "B027",
    "bookName": "The Martian",
    "author": "Andy Weir",
    "image": "https://i.ibb.co/FwS9kZZ/Hard-Cover-4-1-removebg-preview.png",
    "review": "The Martian by Andy Weir is a gripping science fiction novel that follows astronaut Mark Watney, who is stranded on Mars after a mission gone wrong. As Watney battles against the harsh environment and dwindling supplies, he must rely on his ingenuity and resourcefulness to survive. Weir's writing is fast-paced and filled with scientific detail, creating a sense of urgency and suspense that keeps readers on the edge of their seats. The Martian is not only a thrilling survival story but also a testament to the power of human resilience and the indomitable spirit of exploration.",
    "totalPages": 369,
    "rating": 4.5,
    "category": "Science Fiction",
    "tags": ["Space Exploration", "Survival"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2011
  },
  {
    "id": 28,
    "bookId": "B028",
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co/yy80wY6/Hard-Cover-5-1-V2-removebg-preview.png",
    "review": "The Silent Patient by Alex Michaelides is a gripping psychological thriller that unravels the mystery of Alicia Berenson, a famous painter who murders her husband and then stops speaking. Theo Faber, a forensic psychologist, becomes obsessed with uncovering the truth behind Alicia's silence, delving into her past and unraveling shocking secrets along the way. Michaelides' writing is taut and suspenseful, building tension with each twist and turn in the narrative. The Silent Patient explores themes of guilt, obsession, and the complexities of the human mind, offering a compelling and thought-provoking exploration of identity and deception.",
    "totalPages": 336,
    "rating": 4.4,
    "category": "Thriller",
    "tags": ["Psychological", "Mystery"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "id": 29,
    "bookId": "B029",
    "bookName": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://i.ibb.co/VQBVYqZ/Hardcover-Transparent-removebg-preview.png",
    "review": "Where the Crawdads Sing by Delia Owens is a haunting and atmospheric novel set in the marshlands of North Carolina. The story follows Kya Clark, known as the \"Marsh Girl,\" who grows up in isolation after being abandoned by her family. As she matures, Kya becomes a skilled naturalist and artist, but her solitude is shattered when she becomes embroiled in a murder investigation. Owens' prose is lyrical and evocative, capturing the beauty of the natural world and the loneliness of Kya's existence. Where the Crawdads Sing is a poignant exploration of loneliness, resilience, and the indomitable human spirit.",
    "totalPages": 384,
    "rating": 4.7,
    "category": "Literary Fiction",
    "tags": ["Nature", "Isolation"],
    "publisher": "G.P. Putnam's Sons",
    "yearOfPublishing": 2018
  },
  {
    "id": 30,
    "bookId": "B030",
    "bookName": "The Book Thief",
    "author": "Markus Zusak",
    "image": "https://i.ibb.co/Qnj5D7x/images-1-removebg-preview.png",
    "review": "The Book Thief by Markus Zusak is a poignant and unforgettable novel set in Nazi Germany, narrated by Death itself. The story follows Liesel Meminger, a young girl who finds solace in stealing books and sharing them with others during the horrors of World War II. Through Liesel's eyes, readers witness the power of words to heal, to comfort, and to defy tyranny. Zusak's writing is lyrical and profound, weaving together themes of love, loss, and the resilience of the human spirit in the face of adversity. The Book Thief is a testament to the enduring power of stories and the bond they forge between people in the darkest of times.",
    "totalPages": 552,
    "rating": 4.4,
    "category": "Historical Fiction",
    "tags": ["World War II", "Friendship"],
    "publisher": "Alfred A. Knopf",
    "yearOfPublishing": 2005
  },
  {
    "id": 31,
    "bookId": "B031",
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/C2qLR8f/images-2-removebg-preview.png",
    "review": "The Alchemist by Paulo Coelho is a timeless tale of adventure, self-discovery, and the pursuit of one's dreams. The story follows Santiago, a shepherd boy who embarks on a journey across the deserts of Egypt in search of a treasure. Along the way, he encounters wise mentors, learns valuable lessons about listening to his heart, and discovers that the true treasure lies within himself. Coelho's writing is lyrical and philosophical, offering insights into the nature of destiny, faith, and the transformative power of pursuing one's personal legend. The Alchemist continues to inspire readers around the world with its message of hope and the courage to follow one's dreams.",
    "totalPages": 208,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Adventure", "Philosophy"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "id": 32,
    "bookId": "B032",
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.ibb.co/41HVsbr/images-4-removebg-preview.png",
    "review": "The Hunger Games by Suzanne Collins is a thrilling dystopian novel set in a post-apocalyptic world where the Capitol holds an annual televised event in which children fight to the death. The story follows Katniss Everdeen, a young girl from a poor district who volunteers to take her sister's place in the deadly competition. As Katniss navigates the brutal arena and faces off against other tributes, she becomes a symbol of resistance against the oppressive regime. Collins' writing is fast-paced and suspenseful, exploring themes of survival, sacrifice, and the consequences of power. The Hunger Games is a gripping tale that raises questions about morality, resilience, and the fight for justice.",
    "totalPages": 374,
    "rating": 4.4,
    "category": "Young Adult",
    "tags": ["Dystopia", "Survival"],
    "publisher": "Scholastic Press",
    "yearOfPublishing": 2008
  },
  {
    "id": 33,
    "bookId": "B033",
    "bookName": "Gone Girl",
    "author": "Gillian Flynn",
    "image": "https://i.ibb.co/PYfk4xK/images-6-removebg-preview.png",
    "review": "Gone Girl by Gillian Flynn is a dark and suspenseful thriller that delves into the complexities of marriage, deception, and media sensationalism. The story alternates between the perspectives of Nick and Amy Dunne, a seemingly perfect couple whose marriage unravels after Amy goes missing on their fifth wedding anniversary. As the investigation unfolds and secrets are revealed, both Nick and Amy's true selves come to light, challenging perceptions and keeping readers guessing until the shocking conclusion. Flynn's writing is sharp and twisted, exploring themes of identity, manipulation, and the darker aspects of human relationships. Gone Girl is a gripping psychological thriller that leaves a lasting impact.",
    "totalPages": 419,
    "rating": 4.1,
    "category": "Thriller",
    "tags": ["Mystery", "Deception"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2012
  },
  {
    "id": 34,
    "bookId": "B034",
    "bookName": "The Fault in Our Stars",
    "author": "John Green",
    "image": "https://i.ibb.co/7bm0vyZ/download-removebg-preview.png",
    "review": "The Fault in Our Stars by John Green is a poignant and heartrending novel about love, loss, and the fragility of life. The story follows Hazel Grace Lancaster, a sixteen-year-old cancer patient who meets Augustus Waters at a support group. Their bond deepens as they confront their illnesses and embark on a journey to Amsterdam to meet Hazel's favorite author. Green's writing is honest and emotionally resonant, capturing the joys and sorrows of living with illness while celebrating the beauty of human connections. The Fault in Our Stars is a moving exploration of mortality, resilience, and the power of love to transcend even the darkest of times.",
    "totalPages": 313,
    "rating": 4.5,
    "category": "Young Adult",
    "tags": ["Cancer", "Love"],
    "publisher": "Dutton Books",
    "yearOfPublishing": 2012
  },
  {
    "id": 35,
    "bookId": "B035",
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/72HvTBd/Hard-Cover-1-1-removebg-preview.png",
    "review": "The Great Gatsby by F. Scott Fitzgerald is a classic American novel that explores themes of decadence, idealism, and the American Dream during the Roaring Twenties. The story is narrated by Nick Carraway, who becomes drawn into the glamorous and mysterious world of his wealthy neighbor, Jay Gatsby. As Nick uncovers Gatsby's obsession with the beautiful Daisy Buchanan and the lengths he will go to win her love, the novel exposes the hollow pursuit of wealth and the fleeting nature of dreams. Fitzgerald's writing is lyrical and evocative, painting a vivid portrait of Jazz Age society and its disillusionments. The Great Gatsby remains a timeless commentary on the power and limitations of the American Dream.",
    "totalPages": 180,
    "rating": 4.2,
    "category": "Classic Literature",
    "tags": ["Roaring Twenties", "Obsession"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "id": 36,
    "bookId": "B036",
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/7QRBBMT/Hard-Cover-1-2-removebg-preview.png",
    "review": "Pride and Prejudice by Jane Austen is a beloved classic novel that explores themes of love, marriage, and societal expectations in early 19th-century England. The story follows Elizabeth Bennet, a witty and independent young woman, as she navigates the complexities of social class and romance. When she meets the enigmatic Mr. Darcy, their initial prejudices and misunderstandings give way to a slow-burning romance marked by personal growth and mutual understanding. Austen's writing is witty and insightful, offering sharp social commentary while portraying memorable characters and romantic tension. Pride and Prejudice is a timeless tale that continues to captivate readers with its humor, romance, and exploration of human relationships.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Classic Literature",
    "tags": ["Romance", "Social Commentary"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "id": 37,
    "bookId": "B037",
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/k3kdWf4/Hard-Cover-2-2-removebg-preview.png",
    "review": "Harry Potter and the Sorcerer's Stone by J.K. Rowling is the first installment in the iconic Harry Potter series that follows the magical journey of a young wizard, Harry Potter, who discovers his true identity on his eleventh birthday. Attending Hogwarts School of Witchcraft and Wizardry, Harry learns about friendship, courage, and the power of love while uncovering mysteries surrounding his past and facing the dark wizard Voldemort. Rowling's storytelling is enchanting and immersive, creating a richly imagined world filled with memorable characters and magical adventures. Harry Potter and the Sorcerer's Stone captivates readers of all ages with its blend of fantasy, adventure, and themes of destiny and self-discovery.",
    "totalPages": 309,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Magic", "Friendship"],
    "publisher": "Bloomsbury Publishing",
    "yearOfPublishing": 1997
  },
  {
    "id": 38,
    "bookId": "B038",
    "bookName": "The Girl with the Dragon Tattoo",
    "author": "Stieg Larsson",
    "image": "https://i.ibb.co/FwS9kZZ/Hard-Cover-4-1-removebg-preview.png",
    "review": "The Girl with the Dragon Tattoo by Stieg Larsson is a gripping mystery novel that introduces Lisbeth Salander, a brilliant but troubled hacker, and Mikael Blomkvist, an investigative journalist. Together, they delve into the disappearance of Harriet Vanger, uncovering dark secrets that threaten the powerful Vanger family. Larsson's writing is intricate and suspenseful, weaving together themes of corruption, abuse, and justice. The novel explores complex characters and societal issues while keeping readers on the edge of their seats with its twists and turns. The Girl with the Dragon Tattoo is a compelling start to the Millennium series, known for its gritty realism and unflinching portrayal of violence and redemption.",
    "totalPages": 672,
    "rating": 4.4,
    "category": "Mystery",
    "tags": ["Thriller", "Hacker"],
    "publisher": "Norstedts Förlag",
    "yearOfPublishing": 2005
  },
  {
    "id": 39,
    "bookId": "B039",
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/yy80wY6/Hard-Cover-5-1-V2-removebg-preview.png",
    "review": "To Kill a Mockingbird by Harper Lee is a powerful novel that explores themes of racial injustice, moral growth, and empathy in the American South during the 1930s. The story is narrated by Scout Finch, a young girl whose father, lawyer Atticus Finch, defends a black man falsely accused of raping a white woman. Through Scout's eyes, readers witness the impact of prejudice and the courage it takes to challenge societal norms. Lee's writing is poignant and thought-provoking, capturing the complexities of human nature and the importance of compassion. To Kill a Mockingbird remains a timeless classic that confronts difficult truths and inspires readers to confront injustice with integrity and empathy.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Classic Literature",
    "tags": ["Racism", "Coming-of-age"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "id": 40,
    "bookId": "B040",
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/VQBVYqZ/Hardcover-Transparent-removebg-preview.png",
    "review": "1984 by George Orwell is a dystopian novel that presents a chilling vision of a totalitarian society where individuality and freedom are suppressed. The story follows Winston Smith, a low-ranking bureaucrat in the Party who begins to rebel against the oppressive regime led by Big Brother. As Winston navigates surveillance, propaganda, and thought control, he grapples with the consequences of challenging authority and seeking truth in a world dominated by lies. Orwell's writing is bleak and prophetic, offering a stark warning about the dangers of totalitarianism and the erosion of human rights. 1984 remains a haunting portrayal of power, surveillance, and the struggle for truth in a dystopian future.",
    "totalPages": 328,
    "rating": 4.5,
    "category": "Dystopian Fiction",
    "tags": ["Totalitarianism", "Surveillance"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  }
]
